Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Copyright (c) 1997-2010 Tom Christiansen, Nathan Torkington, and other authors as noted.
es: Copyright (c) 1997-2010 Tom Christiansen, Nathan Torkington y otros autores indicados.

source: Count=1
es: Contador=1

source: Count=2
es: Contador=2

source: Count=3
es: Contador=3

source: Count=9
es: Contador=9

source: Create whatever directory structures are required (i.e., for C<Some::Module>, create C<$ENV{MACPERL}site_lib:Some:> and put C<Module.pm> in that directory).
es: Cree las estructuras de directorios necesarias (es decir, para C<Mi::Modulo>, cree C<$ENV{MACPERL}site_lib:Mi:> y coloque C<Modulo.pm> en ese directorio).

source: Created commit 6196c1d: Rename Leon Brocard to Orange Brocard
es: Created commit 6196c1d: Cambio de nombre de Leon Brocard a Orange Brocard

source: Creating a topic branch makes it easier for the maintainers to rebase or merge back into the master blead for a more linear history.
es: La creación de una rama puntual facilita a los mantenedores la reorganización o combinación en la rama blead principal, a fin de tener un historial más lineal.

source: Critical bug fix patches should be made against the relevant maint branches, or should be submitted with a note indicating all the branches where the fix should be applied.
es: Los parches de corrección de errores graves deben aplicarse a las ramas de mantenimiento correspondientes, o enviarse con una nota que indique todas las ramas a las que se debe aplicar la corrección.

source: Current Perl's should handle this problem correctly.
es: Este problema está solucionado en la versión actual de Perl,

source: Current maintainer: Mark Allen C<< <mallen@cpan.org> >>
es: Mantenedor actual: Mark Allen C<< <mallen@cpan.org> >>

source: Currently CLONE is called with no parameters other than the invocant package name, but code should not assume that this will remain unchanged, as it is likely that in future extra parameters will be passed in to give more information about the state of cloning.
es: Actualmente se llama a C<CLONE> sin más parámetros que el nombre del paquete que llama, pero esto podría cambiar; es probable que en el futuro se pasen parámetros adicionales para proporcionar más información sobre el estado de la clonación.

source: Currently NAME is restricted to simple identifiers only.
es: Actualmente NOMBRE está limitado a identificadores sencillos únicamente.

source: Currently the master repository is configured to forbid non-fast-forward merges.
es: Actualmente el repositorio principal está configurado para prohibir combinaciones que no sean de avance rápido.

source: Currently there are three lvalue modifiers: L<my|perlfunc/my>, L<our|perlfunc/our>, and L<local|perlfunc/local>.
es: Actualmente hay tres modificadores de valores-izquierda: L<my|perlfunc/my>, L<our|perlfunc/our> y L<local|perlfunc/local>.

source: Currently, the rules to determine where the C<code> ends are somewhat convoluted.
es: En la actualidad, las reglas para determinar dónde finaliza el C<código> son algo enrevesadas.

source: Currently, those are perl5.14.x and perl5.12.x, respectively.
es: En la actualidad, éstas son perl5.16.x y perl5.14.x respectivamente.

source: DBM Filters are useful for a class of problems where you I<always> want to make the same transformation to all keys, all values or both.
es: Los filtros DBM son útiles para un tipo de problema en el que se desea aplicar I<siempre> la misma transformación a todas las claves, a todos los valores, o a todas las claves y todos los valores.

source: DBM files allow a Perl program to keep a persistent L</hash> across multiple invocations.
es: Los archivos DBM permiten que un programa Perl mantenga un L</hash> persistente entre varias invocaciones.

source: DEBUG (?:p) no capture
es: DEPURACIÓN (?:p) sin captura

source: DECOMPRESS
es: DESCOMPRIMIR

source: DWIM is an acronym for "Do What I Mean", the principle that something should just do what you want it to do without an undue amount of fuss.
es: DWIM es el acrónimo de "Do What I Mean" (haz lo que te ordeno), el principio de que algo debe hacer lo que se le ordena sin rechistar.

source: Dave R 5.15.6 2011-Dec-20
es: Dave R 5.15.6 2011-Dic-20

source: David G 5.15.0 2011-Jun-20 The 5.15 development track
es: David G 5.15.0 2011-Jun-20 Serie de desarrollo de v5.15

source: David M 5.10.1-RC1 2009-Aug-06 The 5.10 maintenance track 5.10.1-RC2 2009-Aug-18 5.10.1 2009-Aug-22
es: David M 5.10.1-RC1 2009-Ago-06 Serie de mantenimiento de v5.10 5.10.1-RC2 2009-Ago-18 5.10.1 2009-Ago-22

source: Decimal strings may have an exponential notation part, as in C<"12.34e-56">.
es: Las cadenas decimales pueden tener una parte en notación exponencial (por ejemplo, C<"12.34e-56">).

source: Decode everything you receive, encode everything you send out.
es: Descodifique todo lo que reciba y codifique todo lo que envíe

source: Decoding can't happen reliably if you don't know how the data was encoded.
es: No es posible descodificar de manera fiable si no se sabe cómo se codificaron los datos.

source: Decompress the file with C<gzip -d yourmodule.tar.gz>
es: Ejecute C<gzip -d mimodulo.tar.gz> para descomprimir el módulo

source: Define a named capture group.
es: Define un grupo de captura con nombre.

source: Deprecated in Perl 5.10.0
es: Obsoleta en Perl 5.10.0

source: Deprecated modules and features are those which were part of a stable release, but later found to be subtly flawed, and which should be avoided.
es: Las características y los módulos obsoletos son los que en su momento formaron parte de una versión estable pero que tienen algún defecto sutil, por lo que es aconsejable evitar su uso.

source: Deprecation warnings are issued under B<-w> or C<use diagnostics>, and notices are found in L<perldelta>s, as well as various other PODs.
es: Con B<-w> o C<use diagnostics> se muestran advertencias de elementos obsoletos, y también se publican avisos en los documentos L<perldelta> y en otros documentos POD.

source: Derived from many sources.
es: Derivado de muchas fuentes.

source: Described in L<POSIX>.
es: Se describe en L<POSIX>.

source: Described in L<perldebtut>, L<perldebug> and L<perldebguts>.
es: Se describe en L<perldebtut>, L<perldebug> y L<perldebguts>.

source: Described in L<perlembed>, L<perlxstut>, L<perlxs>, L<perlcall>, L<perlguts>, and L<xsubpp>.
es: Se describe en L<perlembed>, L<perlxstut>, L<perlxs>, L<perlcall>, L<perlguts> y L<xsubpp>.

source: Described in L<perlmod>, L<perlmodlib>, and L<perlmodinstall>.
es: Se describe en L<perlmod>, L<perlmodlib> y L<perlmodinstall>.

source: Described in L<perlobj>, L<perlboot>, L<perltoot>, L<perltooc>, and L<perlbot>.
es: Se describe en L<perlobj>, L<perlboot>, L<perltoot>, L<perltooc> y L<perlbot>.

source: Described in L<perlre>, with additional examples in L<perlop>.
es: Se describe en L<perlre>, con ejemplos adicionales en L<perlop>.

source: Described in L<perlreftut>, L<perlref>, L<perldsc>, and L<perllol>.
es: Se describe en L<perlreftut>, L<perlref>, L<perldsc> y L<perllol>.

source: Described in L<perlsub>.
es: Se describe en L<perlsub>

source: Described in L<perlthrtut> and L<threads>.
es: Se describe en L<perlthrtut> y L<threads>.

source: Described in L<perltie> and L<AnyDBM_File>.
es: Se describe en L<perltie> y L<AnyDBM_File>.

source: Described in L<perluniintro>, L<perllocale> and L<Locale::Maketext>.
es: Se describe en L<perluniintro>, L<perllocale> y L<Locale::Maketext>.

source: Descriptive editing term--short for "awkward".
es: Término de edición descriptivo; abreviatura de "awkward" (poco práctico).

source: Details are in L<perlop/Quote and Quote-like Operators>.
es: Puede ver los detalles en L<perlop/Comillas y operadores de comillas>.

source: Details in L</"/x">
es: Para obtener más información, vea L</"/x">

source: Determines whether you do the left L</operator> first or the right L</operator> first when you have "A L</operator> B L</operator> C" and the two operators are of the same precedence.
es: Determina si en "A L</operador> B L</operador> C" se aplica primero el L</operador> de la izquierda o el L</operador> de la derecha cuando ambos operadores tienen la misma precedencia.

source: Did we mention that you should definitely consider using the B<-w> switch?
es: No olvide que es muy importante utilizar el modificador B<-w>.

source: Different definitions of Perl are given in L<perl>, L and no doubt other places.
es: En L<perl>, L y en muchos otros sitios se incluyen definiciones de Perl.

source: Different kinds of sockets have different kinds of addresses--some look like filenames, and some don't.
es: Los distintos tipos de sockets tienen distintos tipos de direcciones; algunas parecen nombres de archivo y otras no.

source: Dig into a bunch of modules to see how they're written.
es: Analice minuciosamente unos cuantos módulos para ver cómo los han programado.

source: Display docs using plain B<t>ext converter, instead of nroff.
es: Muestra los documentos con un conversor de B<t>exto simple, en lugar de nroff.

source: Display onB<l>y the file name of the module found.
es: Muestra sóB<l>o el nombre de archivo del módulo encontrado.

source: Display the entire module: both code and unformatted pod documentation.
es: Muestra el módulo completo: tanto el código como la documentación pod sin formato.

source: Displays the version of perldoc you're running.
es: Muestra la versión de perldoc que se ejecuta actualmente.

source: Do case-insensitive pattern matching.
es: Busca coincidencias de patrones sin distinguir mayúsculas de minúsculas.

source: Do not consider one style to be better than others - "There Is More Than One Way Of Doing It" is one Perl's mottos.
es: Ningún estilo es mejor que otro. No olvide que uno de los lemas de Perl es "Se puede hacer de varias maneras".

source: Do not patch these modules directly!
es: No debe aplicar parches a estos módulos directamente.

source: Do not wait for Perl 6 to do whatever you need to do.
es: No espere a que salga Perl 6 para hacer lo que tenga que hacer.

source: Do note that the examples have been written by many different authors over a period of several decades.
es: Tenga en cuenta que los ejemplos han sido escritos por muchos autores distintos a lo largo de varias décadas.

source: Do the proper conversions (by decoding/encoding), and things will work out well: you get character counts for decoded data, and byte counts for encoded data.
es: Realice las conversiones apropiadas (mediante descodificación o codificación) y todo saldrá bien: contará caracteres para los datos descodificados y bytes para los datos codificados.

source: Do whatever you can to find out, and if you have to: guess.
es: Haga lo que pueda para averiguar cuál es la codificación; adivínela, si no queda más remedio

source: Does not evaluate as either a string or a number.
es: Su evaluación no devuelve una cadena ni un número.

source: Does the module require compilation (i.e. does it have files that end in .xs, .c, .h, .y, .cc, .cxx, or .C)?
es: ¿Hay que compilar el módulo (es decir, contiene archivos con la extensión .xs, .c, .h, .y, .cc, .cxx o .C)?

source: Dogmatically advocating anything tends to make people discount your message.
es: En cambio, si defiende sus ideas de manera dogmática, hará que las personas desconfíen de su mensaje.

source: Doing it only once will curl your hair.
es: Hacerlo una sola vez simplemente le riza el pelo.

source: Doing something repeatedly.
es: Hacer algo repetidamente.

source: Doing these checks by hand can quickly become tedious.
es: Hacer manualmente estas comprobaciones puede resultar tedioso.

source: Don't be scared, the "postmodern" label is a callback to Larry's description of Perl as "the first postmodern computer language".
es: No se asuste, la etiqueta "postmoderno" es una referencia a la descripción de Perl que hizo Larry: "el primer lenguaje de programación postmoderno".

source: Don't ask.
es: No pregunte.

source: Don't be afraid to use loop labels--they're there to enhance readability as well as to allow multilevel loop breaks.
es: No tenga miedo de usar etiquetas en bucles; mejoran la legibilidad y permiten establecer salidas de bucle en varios niveles.

source: Don't bother.
es: No es necesario.

source: Don't create a class named "0" unless you know what you're doing.
es: No cree una clase llamada "0" a menos que sepa exactamente lo que está haciendo.

source: Don't forget Perl modules, either.
es: Y no olvidemos los módulos Perl.

source: Don't forget that with the new PerlIO layered I/O abstraction C<FILE*> types may not even be available.
es: No olvide que con PerlIO, la nueva abstracción de E/S en capas, los tipos C<FILE*> podrían no estar disponibles.

source: Don't go through silly contortions to exit a loop at the top or the bottom, when Perl provides the C<last> operator so you can exit in the middle.
es: No tiene que hacer filigranas para salir de un bucle al principio o al final. Perl dispone del operador C<last>, con el que puede salir desde cualquier punto.

source: Don't use it.
es: No lo use.

source: Don't use slash as a delimiter when your regexp has slashes or backslashes.
es: Si una expresión regular contiene barras diagonales o barras diagonales inversas, no use barras diagonales como delimitadores.

source: Double quotes or single quotes may be used around literal strings:
es: Las cadenas literales se pueden escribir entre comillas dobles o simples:

source: Dromedary syncs the git tree from camel every few minutes, you should not push there.
es: El servidor I<dromedary> sincroniza el árbol git de I<camel> cada pocos minutos. No debe insertar cambios en I<camel>.

source: Dropping modules is currently not an option, but further developments may clear the last barriers.
es: Actualmente no es posible quitar módulos, pero hay desarrollos recientes encaminados hacia ese fin.

source: Due to the nature of git, this is now impossible to fix in the public repository.
es: Por la naturaleza de git, es imposible corregir esto en el repositorio público.

source: During global destruction, Perl will always garbage collect objects before unblessed references.
es: Durante la fase de destrucción global, Perl siempre reclamará la memoria usada por los objetos antes que la de las referencias no bendecidas.

source: Dwimming can require a great deal of behind-the-scenes magic, which (if it doesn't stay properly behind the scenes) is called a L</dweomer> instead.
es: Esto puede requerir una gran cantidad de magia entre bastidores, en cuyo caso (si no permanece oculto entre bastidores) se llamará L</dweomer>.

source: Dynamic scoping works over a dynamic scope, making variables visible throughout the rest of the L</block> in which they are first used and in any L<subroutines|/subroutine> that are called by the rest of the block.
es: El control de ámbito dinámico se hace sobre un ámbito dinámico, de forma que las variables estén visibles en el resto del L<bloque|/bloqueo-bloque> en el que se usan por primera vez y en las L<subrutinas|/subrutina> llamadas por el resto del bloque.

source: Dynamically scoped variables can have their values temporarily changed (and implicitly restored later) by a L<local|perlfunc/local> operator.
es: Se puede cambiar temporalmente el valor de las variables de ámbito dinámico (y restaurarlo posteriormente) mediante un operador L<local|perlfunc/local>.

source: E.g., C<$obj-E<gt>as_string()>.
es: P. ej., C<$obj-E<gt>como_cadena()>.

# END blocks run LIFO at quitting time. " }
source: END blocks run LIFO at quitting time.\n" }
es: Los bloques END se ejecutan en orden LIFO al finalizar.\n" }

source: END { ... } # module clean-up code here (global destructor)
es: END { ... } # el código de limpieza del módulo va aquí (destructor global)

source: Each L</expression> in a L</LIST> is evaluated in L</list context> and interpolated into the list value.
es: Cada L</expresión> de una L</LISTA> se evalúa en L</contexto de lista> y se interpola en el valor de lista.

source: Each environment variable is a L</key>/L</value> pair, like one entry in a L</hash>.
es: Cada variable de entorno es un par L</clave>-L</valor>, como una entrada de un L</hash>.

source: Each major version has significant differences that earlier versions cannot support.
es: Cada versión principal incorpora diferencias importantes que no son compatibles con las versiones anteriores.

source: Each branch on the remote will be exactly tracked by these branches.
es: Estas ramas harán un seguimiento exacto de cada rama del repositorio remoto.

source: Each character is just that: the character.
es: Cada carácter no es más que eso: un carácter.

source: Each class can define its B<attributes>.
es: Cada clase puede definir sus B<atributos>.

source: Each line of the I</etc/passwd> file is a record, keyed on login name, containing information about that user.
es: Cada línea del archivo I</etc/passwd> es un registro correspondiente a un nombre de inicio de sesión, que contiene información sobre dicho usuario.

source: Each number turns into a L</character> with the specified ordinal value.
es: Cada número se convierte en un L</carácter> con el valor ordinal especificado.

source: Each of the elementary pieces of regular expressions which were described before (such as C<ab> or C<\Z>) could match at most one substring at the given position of the input string.
es: Cada una de las partes elementales de las expresiones regulares que se han descrito anteriormente (por ejemplo, C<ab> o C<\Z>) podría coincidir como mucho con una subcadena en la posición indicada de la cadena de entrada.

source: Each of the methods works identically, and is used to install (or uninstall) a single DBM Filter.
es: Todos los métodos funcionan de la misma manera y se usan para instalar (o desinstalar) un filtro DBM individual.

source: Each package contains a special array called C<@ISA>.
es: Cada paquete contiene un array especial llamado C<@ISA>.

source: Each plugin should register itself by providing the following structure
es: Cada complemento debe registrarse a sí mismo proporcionando la siguiente estructura

source: Each programmer will, of course, have his or her own preferences in regards to formatting, but there are some general guidelines that will make your programs easier to read, understand, and maintain.
es: Cada programador tendrá, naturalmente, sus propias preferencias con respecto al estilo, pero hay algunas directrices que harán que sus programas resulten más fáciles de leer, entender y mantener.

source: Each version of Perl comes with the documentation that was current at the time of release.
es: Cada versión de Perl incluye documentación actualizada en el momento del lanzamiento.

source: Earlier, we mentioned that the C<File> class's C<last_mod_time> accessor could return a L<DateTime> object.
es: Se ha mencionado previamente que en la clase C<Archivo> el método de acceso al miembro C<hora_ult_mod> podría devolver un objeto de la clase L<DateTime>.

source: Edit F<.git/config> with the git-config(1) command:
es: Edite F<.git/config> con el comando git-config(1):

source: Editorial adjustments by Gurusamy Sarathy <gsar@ActiveState.com>
es: Ajustes editoriales de Gurusamy Sarathy <gsar@ActiveState.com>

source: Either a regular L</assignment>, or a compound L</operator> composed of an ordinary assignment and some other operator, that changes the value of a variable in place, that is, relative to its old value.
es: Puede ser una L</asignación> normal o un L</operador> compuesto, formado por una asignación normal y otro operador que cambie el valor de una variable in situ, es decir, con respecto a su valor anterior.

source: Embedded newlines will not be matched by "^" or "$".
es: Los caracteres de nueva línea incrustados dentro de la cadena no se pueden detectar con "^" o "$".

source: Emptying a file of existing contents, either automatically when opening a file for writing or explicitly via the L<truncate|perlfunc/truncate> function.
es: Vaciar un archivo de contenido existente, ya sea de forma automática al abrir un archivo para escritura o explícitamente mediante la función L<truncate|perlfunc/truncate>.

source: Encapsulation is important for several reasons.
es: La encapsulación es importante por varias razones.

source: Encapsulation means that the user of an object does not have to know how it is implemented.
es: La encapsulación significa que el usuario de un objeto no tiene por qué conocer cómo está implementado.

source: Encode explicitly to avoid weird bugs, and to show to maintenance programmers that you thought this through.
es: Codifique explícitamente para evitar errores extraños y para que los programadores que van a mantener el código vean que ha pensado en todo.

source: Encode and output
es: Codificar y emitir los resultados

source: End of File.
es: Final del archivo.

source: End_Lines
es: Fin

source: Entire arrays (and slices of arrays and hashes) are denoted by '@', which works much as the word "these" or "those" does in English, in that it indicates multiple values are expected.
es: Se usa el carácter "@" para indicar que una variable es un array completo (o una porción de array o hash). Funciona de manera parecida a las palabras "estos/esos" o "estas/esas" del español, que indican que se esperan múltiples valores.

source: Entire hashes are denoted by '%': X<hash>
es: Para designar variables que contienen hashes completos, se usa el carácter "%": X<hash>

source: Equivalent to C<< (?&NAME) >>.
es: Equivalente a C<< (?&NOMBRE) >>.

source: Equivalent to C<< (?<NAME>pattern) >>.
es: Equivalente a C<< (?<NOMBRE>patrón) >>.

source: Equivalent to C<< \g{NAME} >>.
es: Equivalente a C<< \g{NOMBRE} >>.

source: Errors that happen inside an L<eval|perlfunc/eval> are not fatal.
es: Los errores que se producen dentro de una función L<eval|perlfunc/eval> no son irrecuperables.

source: Especially C<_utf8_on> can be dangerous, for the same reason that C can.
es: En particular, el uso de C<_utf8_on> puede resultar peligroso, por las mismas razones que el uso de C.

source: Even if the thing you're communicating with is also written in Perl.
es: (aunque dicha entidad externa también se haya programado en Perl).

source: Even if you aren't in doubt, consider the mental welfare of the person who has to maintain the code after you, and who will probably put parentheses in the wrong place.
es: Aunque usted no tenga dudas, piense en el bienestar mental de la persona que tendrá que mantener el código en el futuro; es probable que ponga los paréntesis en el lugar equivocado.

source: Even more loosely, a Perl L</statement>, which might start with a L</label> and typically ends with a semicolon.
es: Según una definición todavía más informal, es una L</instrucción> Perl que puede empezar con una L</etiqueta> y terminar con un signo de punto y coma.

source: Even the most minimal of them eliminates a lot of repetitive boilerplate.
es: Incluso los más sencillos le ahorrarán tener que escribir el mismo código repetidamente.

source: Even though it doesn't do much, it is still preferable to writing your own classes from scratch.
es: Aunque no le quitará mucho trabajo, es preferible a escribir sus propias clases desde cero.
